import time

def one():
    print("-------------------------------------------------------------------------------------------------")
    print("Задача 1: Начала ждать 8 секунд...")
    print("-------------------------------------------------------------------------------------------------")
    time.sleep(8)
#     a = (i for i in range(100_000))
#     print(*a)
    print("Задача 1: ПРОСНУЛАСЬ!")
    # Уменьшим до 100, чтобы не вешать консоль
    a = [i for i in range(100)]
    print(f"Результат 1: {a}")

def two():
    print("-------------------------------------------------------------------------------------------------")
    print("Задача 2: Начала ждать 6 секунд...")
    time.sleep(6)
#     a = (i for i in range(100_000))
#     print(*a)
    print("Задача 2: ПРОСНУЛАСЬ!")
    a = [i for i in range(100)]
    print(f"Результат 2: {a}")

def three():
    print("-------------------------------------------------------------------------------------------------")
    print("Задача 3: Начала ждать 3 секунды...")
    time.sleep(3)
#     a = (i for i in range(100_000))
#     print(*a)
    print("Задача 3: ПРОСНУЛАСЬ!")
    a = [i for i in range(100)]
    print(f"Результат 3: {a}")

def main():
    time_start = time.perf_counter()
    one(), two(), three()
    time_end = time.perf_counter()
    print(time_end - time_start)

main()